{
  "currentVersion": "2.20.0",
  "narrativeSummary": "The system now supports multiple modules. A new Project Bank module has been added alongside the existing AIMS module, with its own sidebar navigation, dashboard, and project submission flow. The sidebar detects which module you are in and shows the appropriate navigation groups, CTA button, and dashboard link. Database types for Project Bank tables, NDP goals, land parcels, and appraisal records have been added, along with a new Origin column on the activity list to distinguish donor-reported activities from Project Bank entries.",
  "releases": [
    {
      "version": "2.20.0",
      "date": "2026-02-25",
      "narrativeSummary": "This is the foundation for turning the system from a single AIMS application into a multi-module platform. The sidebar now detects which module you are in based on the URL &mdash; <code>/project-bank/*</code> shows the Project Bank navigation, everything else shows the familiar AIMS navigation &mdash; and a &ldquo;Back to Home&rdquo; link at the top lets you jump between modules. The Project Bank sidebar includes Dashboard, All Projects, Submit New, Funding Gaps, and PPP Pipeline items, with its own &ldquo;Submit Project&rdquo; CTA button gated by a new <code>canCreateProjects</code> permission. On the AIMS side, the activity list gains an Origin column that shows whether each activity was donor-reported or came from the Project Bank, displayed as colour-coded badges. Behind the scenes, full TypeScript types have been added for the new database tables: <code>project_bank_projects</code>, <code>project_bank_donors</code>, <code>project_appraisals</code>, <code>project_documents</code>, <code>appraisal_shadow_prices</code>, <code>land_parcels</code>, and <code>national_development_goals</code>. The admin panel gains an NDP Goals tab for managing national development plan goals. The home route now always points to <code>/home</code> (the entry portal) rather than conditionally routing based on organisation assignment, and <code>getCurrentModule()</code> is the new utility that powers the module-aware navigation.",
      "changes": [
        "<b>Multi-Module Sidebar Navigation</b>",
        "&nbsp;&nbsp;New <code>getCurrentModule()</code> utility in <code>navigation-utils.ts</code> detects the active module from the pathname",
        "&nbsp;&nbsp;Sidebar renders different nav groups, top-level items, and CTA buttons depending on whether you&rsquo;re in AIMS or Project Bank",
        "&nbsp;&nbsp;&ldquo;Back to Home&rdquo; link shown at the top of the sidebar when inside any module",
        "&nbsp;&nbsp;Dashboard link active-state matching tightened to exact path only, preventing child routes from highlighting the parent",
        "<b>Project Bank Sidebar</b>",
        "&nbsp;&nbsp;Five navigation items: Dashboard, All Projects, Submit New, Funding Gaps, PPP Pipeline",
        "&nbsp;&nbsp;&ldquo;Submit Project&rdquo; CTA button gated by <code>canCreateProjects</code> permission",
        "&nbsp;&nbsp;Sidebar counts fetching skipped when not in the AIMS module",
        "<b>Activity Origin Column</b>",
        "&nbsp;&nbsp;New <code>origin</code> column added to activity column configuration (metadata group, hidden by default)",
        "&nbsp;&nbsp;Displays &ldquo;Project Bank&rdquo; (teal badge) or &ldquo;Donor Reported&rdquo; (blue badge) based on the activity&rsquo;s origin field",
        "<b>Database Types</b>",
        "&nbsp;&nbsp;TypeScript types added to <code>supabase.ts</code> for <code>project_bank_projects</code>, <code>project_bank_donors</code>, <code>project_appraisals</code>, <code>project_documents</code>, <code>appraisal_shadow_prices</code>, <code>land_parcels</code>, and <code>national_development_goals</code>",
        "<b>Permissions &amp; Routing</b>",
        "&nbsp;&nbsp;New <code>canCreateProjects</code> permission added to <code>UserPermissions</code> type &mdash; granted to admin, tier-1, and tier-2 roles",
        "&nbsp;&nbsp;Home route now always returns <code>/home</code> regardless of organisation assignment",
        "&nbsp;&nbsp;<code>canCreateProjects</code> passed through <code>MainLayout</code> to <code>SidebarNav</code>",
        "<b>Admin: NDP Goals Tab</b>",
        "&nbsp;&nbsp;New &ldquo;NDP Goals&rdquo; tab added to the admin panel for managing national development plan goals"
      ]
    },
    {
      "version": "2.19.0",
      "date": "2026-02-25",
      "narrativeSummary": "The Aid Effectiveness admin panel has been expanded so each government planning document can carry an acronym and a start/end date with configurable precision &mdash; year only, month and year, or full date. Those details now appear in the option list and in the Aid Effectiveness survey dropdowns, making it easy to distinguish between overlapping national plans. Pooled fund cards on the Funds page now display the activity&rsquo;s banner image across the top of the card if one has been set, and the date range at the bottom has been upgraded from a plain text line to a two-column layout with calendar icons. The card is no longer a giant click target &mdash; only the title link navigates, which removes all the <code>stopPropagation</code> hacks that were scattered through the card&rsquo;s event handlers. Three card-view action menus (Activity Card, Organisation Card, and Task Card) that still relied on the third-party <code>bloom-menu</code> library have been replaced with the standard <code>DropdownMenu</code> component used everywhere else in the system, giving them consistent styling and keyboard navigation. The dashboard hero chart-view toggle (bar/line/table) has been updated to use the same subtle slate highlight as the pagination buttons rather than a filled primary button. Smaller fixes include removing <code>font-mono</code> from sector percentages, upgrading the sector aggregation preview to use a code badge for sector codes, a bar-radius fix on the Funding by Modality chart, and a minor identifier styling tweak in the activity editor.",
      "changes": [
        "<b>Aid Effectiveness Date &amp; Acronym Fields</b>",
        "&nbsp;&nbsp;New <code>acronym</code>, <code>start_date</code>, <code>start_date_precision</code>, <code>end_date</code>, <code>end_date_precision</code> fields on AE options (API create + update)",
        "&nbsp;&nbsp;Admin dialog widened to 600 px with a new <code>FlexibleDateInput</code> component supporting year-only, month+year, or full-date granularity",
        "&nbsp;&nbsp;Option list now shows acronym in parentheses and date range below the label",
        "&nbsp;&nbsp;Survey dropdown options display acronym and date range inline",
        "&nbsp;&nbsp;Admin section renamed from &ldquo;Aid Effectiveness Dropdown Options&rdquo; to &ldquo;Government Planning Documents/Frameworks&rdquo;",
        "<b>Pooled Fund Card Enhancements</b>",
        "&nbsp;&nbsp;Banner image displayed at the top of each fund card when present (API now returns <code>banner</code> field)",
        "&nbsp;&nbsp;Date range replaced with a two-column Start Date / End Date layout using <code>Calendar</code> icons and <code>formatActivityDate()</code>",
        "&nbsp;&nbsp;Card no longer wraps everything in a single click handler &mdash; only the title is a link; all <code>stopPropagation</code> calls removed",
        "&nbsp;&nbsp;Child activity count removed from the utilisation bar label",
        "&nbsp;&nbsp;Acronym moved inside the title link so it&rsquo;s part of the clickable text",
        "&nbsp;&nbsp;Header icon changed to foreground colour",
        "<b>bloom-menu Replacement</b>",
        "&nbsp;&nbsp;Activity Card action menu (<code>ActivityCardActionMenu</code>) migrated from <code>bloom-menu</code> to <code>DropdownMenu</code>",
        "&nbsp;&nbsp;Organisation Card action menu (<code>OrganizationCardActionMenu</code>) migrated from <code>bloom-menu</code> to <code>DropdownMenu</code>",
        "&nbsp;&nbsp;Task Card action menu (<code>TaskActionMenu</code>) migrated from <code>bloom-menu</code> to <code>DropdownMenu</code>",
        "<b>Dashboard Chart-View Toggle</b>",
        "&nbsp;&nbsp;Bar/Line/Table toggle buttons updated from <code>variant=&ldquo;default&rdquo;</code> to <code>bg-slate-200 text-slate-900</code> active style, matching pagination",
        "<b>Minor Fixes</b>",
        "&nbsp;&nbsp;Sector allocation percentages no longer use <code>font-mono</code>",
        "&nbsp;&nbsp;Sector aggregation preview uses a <code>code</code> badge for sector codes instead of stacked text",
        "&nbsp;&nbsp;Funding by Modality chart: bar radius now applied in both stacked and grouped modes",
        "&nbsp;&nbsp;Other Identifier display in activity editor: background changed to <code>bg-background</code> with softer hover, pencil icon ring removed",
        "&nbsp;&nbsp;DatePicker component: added <code>autoFocus</code> to calendar trigger"
      ]
    },
    {
      "version": "2.18.0",
      "date": "2026-02-24",
      "narrativeSummary": "When you opened an activity, the sidebar tabs would all appear empty until you actually clicked into each section and its data finished loading. Now the basic API response includes lightweight record counts for every tab, so completion ticks show up the moment the page loads &mdash; no more guessing which sections already have data. The SDG Alignment section, which used to be a sprawling two-column grid of large cards, has been replaced with a compact summary table; clicking any row or an SDG tile opens a dialog where you configure alignment strength, targets, and notes, then close it when you&rsquo;re done. Contact search now pulls from both the contacts table and the users table so you can find anyone in the system, and it shows results on focus before you start typing. Pagination buttons everywhere &mdash; Activities, Transactions, Budgets, Library, FAQ, Build History, and more &mdash; now use a subtle slate highlight instead of a filled primary button for the active page. The Focal Points tab has been rebuilt to use the same PersonCard component as the Rolodex, the Humanitarian tab moves the &ldquo;Add Scope&rdquo; button into the header area for quicker access, and several analytics charts have had their tooltip and axis formatting tidied up. The fund summary calculation has been corrected so contributions show the most advanced pipeline stage rather than double-counting received plus committed plus pledged amounts. Finally, the dashboard API now excludes internal transfer transactions from totals to prevent inflated figures.",
      "changes": [
        "<b>Instant Tab Completion Indicators</b>",
        "&nbsp;&nbsp;Basic activity API now returns lightweight <code>tabCounts</code> (contacts, focal points, linked activities, results, conditions, etc.) in a single parallel query",
        "&nbsp;&nbsp;Activity editor applies these counts on initial load so sidebar ticks appear immediately",
        "&nbsp;&nbsp;New <code>tabCountsReady</code> state allows <code>getStatusForTab</code> to trust computed status before full group data is lazy-loaded",
        "&nbsp;&nbsp;Clicking a tab now eagerly triggers its group&rsquo;s lazy loader",
        "<b>SDG Alignment Rebuilt</b>",
        "&nbsp;&nbsp;Selected SDGs now displayed in a compact summary <code>Table</code> with columns for SDG, Alignment, Targets, Notes, and Actions",
        "&nbsp;&nbsp;Clicking a row or tile opens a <code>Dialog</code> modal for editing alignment strength, target selection, and contribution notes",
        "&nbsp;&nbsp;Target search uses a controlled <code>CommandInput</code> with client-side filtering instead of the default <code>Command</code> behaviour",
        "&nbsp;&nbsp;Dedicated &ldquo;Remove SDG&rdquo; button in both the table row and the modal footer replaces the old toggle-off behaviour",
        "<b>Contact Search Expanded</b>",
        "&nbsp;&nbsp;API now queries both <code>contacts</code> and <code>users</code> tables in parallel and merges results, deduplicating by email",
        "&nbsp;&nbsp;Returns results on empty query (initial dropdown on focus) with a default limit of 20",
        "&nbsp;&nbsp;Contact search bar updated for on-focus loading and improved result display",
        "<b>Pagination Active-Page Style</b>",
        "&nbsp;&nbsp;Replaced <code>variant=&ldquo;default&rdquo;</code> (filled primary) with <code>bg-slate-200 text-slate-900</code> for the current page button",
        "&nbsp;&nbsp;Applied across 14 paginated views: Activities, Transactions, Budgets, Planned Disbursements, Library, FAQ, Build History, IATI Import, Rolodex, Organisations, Admin Users, Documents, and TransactionsManager",
        "<b>Focal Points Tab Rewrite</b>",
        "&nbsp;&nbsp;Focal point cards replaced with the shared <code>PersonCard</code> component from the Rolodex",
        "&nbsp;&nbsp;Focal-point-specific metadata (status badge, &ldquo;You&rdquo; tag, assigned-by, handoff/remove buttons) displayed below the card",
        "<b>Humanitarian Tab Layout</b>",
        "&nbsp;&nbsp;&ldquo;Add Scope&rdquo; button moved from the Humanitarian Scope card header into the main humanitarian flag section for quicker access",
        "&nbsp;&nbsp;Scope table cells updated: vocabulary now shows a <code>code</code> badge, text colour promoted from muted to foreground for readability",
        "<b>Fund Summary Calculation Fix</b>",
        "&nbsp;&nbsp;Total contributions now use the most advanced pipeline stage (<code>received || committed || pledged</code>) instead of summing all three, preventing inflated headline figures",
        "<b>Dashboard Internal Transfer Exclusion</b>",
        "&nbsp;&nbsp;Dashboard API queries now include <code>receiver_activity_uuid</code> and apply <code>excludeInternalTransfers()</code> to prevent double-counting of pooled fund transfers in analytics totals",
        "<b>Chart &amp; Analytics Tweaks</b>",
        "&nbsp;&nbsp;Multiple dashboard and analytics chart components updated with minor tooltip, axis, and formatting refinements",
        "&nbsp;&nbsp;Aid Effectiveness radio buttons vertically centred with their labels",
        "&nbsp;&nbsp;Countries &amp; Regions vocabulary labels upgraded from <code>text-xs text-gray-400</code> to <code>text-sm text-gray-500</code>",
        "&nbsp;&nbsp;Organisation type text in Participating Orgs table changed from muted to foreground colour"
      ]
    },
    {
      "version": "2.17.0",
      "date": "2026-02-24",
      "narrativeSummary": "This release is about visual consistency and code hygiene. Every dialog and modal in the system &mdash; from adding transactions and contacts to editing organisations, tasks, documents, and meetings &mdash; now opens with the same muted-background header bar and bottom border, so they all feel like they belong to the same application. Filter labels across analytics pages, the library, admin panels, and user management have been simplified from bold slate headings to smaller, quieter muted text so your eye goes to the data, not the chrome. Behind the scenes, the activity-status display logic that was duplicated in five different files has been pulled into a single shared utility, which means status badges now look identical everywhere &mdash; activity cards, the activity editor, and the pooled funds page &mdash; and any future status-related change only needs to happen in one place. We also removed the redundant &ldquo;Story So Far&rdquo; summary card from the Build History page; the per-release narrative card at the top already tells you everything you need to know.",
      "changes": [
        "<b>Consistent Dialog Headers</b>",
        "&nbsp;&nbsp;Base <code>DialogHeader</code> component updated with <code>bg-surface-muted</code> background, <code>border-b</code>, and negative margin to span full width",
        "&nbsp;&nbsp;<code>AlertDialogHeader</code> receives matching treatment with rounded top corners",
        "&nbsp;&nbsp;15+ modals adjusted with <code>mx-0 mt-0</code> overrides so headers sit flush against the dialog edge",
        "&nbsp;&nbsp;Affected: Transaction, Contact, Location, Document, Organisation, Task, Meeting, Compare Data, About, and Library modals",
        "<b>Simplified Filter Labels</b>",
        "&nbsp;&nbsp;All filter labels standardised to <code>text-xs text-muted-foreground</code> via the <code>Label</code> component",
        "&nbsp;&nbsp;Removed bold slate-700 styling and inline icons from filter headings",
        "&nbsp;&nbsp;Affected: SDG Analytics, Sector Analytics, Sector Time Series, Library Filters, FAQ Management, and Admin User Table",
        "<b>Centralised Activity Status Utility</b>",
        "&nbsp;&nbsp;New shared module <code>@/lib/activity-status-utils</code> exports <code>getActivityStatusDisplay()</code> and <code>getActivityStatusLabel()</code>",
        "&nbsp;&nbsp;Replaced duplicate status logic in Activities list, Activity detail page, Activity Card, Activity Card Modern, and Pooled Funds page",
        "&nbsp;&nbsp;Status badges now render identical colours and labels across all views",
        "<b>Build History Cleanup</b>",
        "&nbsp;&nbsp;Removed the &ldquo;Story So Far&rdquo; narrative card &mdash; only the per-release summary card remains at the top of the page",
        "<b>Portfolio Timeline Colours</b>",
        "&nbsp;&nbsp;Organisation portfolio timeline status colours updated to match the system palette (green for active, red for cancelled/suspended, grey default)"
      ]
    },
    {
      "version": "2.16.0",
      "date": "2026-02-24",
      "narrativeSummary": "Tables across the system were starting to feel uneven &mdash; some columns too wide, others too narrow, and the title column would sometimes get squeezed when lots of columns were visible. We switched every data table (Activities, Transactions, Budgets, and Planned Disbursements) to a fixed-layout approach where each column type gets an appropriate width and the title column stretches to fill whatever space is left, so the layout stays balanced at any screen size. A thin filler column at the right edge ensures that row hover highlights extend all the way to the container boundary. On the Pooled Funds side, the Sankey chart now only shows a third tier of child activities when there are actual disbursement values to display, and hovering over any flow link pops up a tooltip showing the donor or child name and dollar amount. We also moved the fund status badge underneath the IATI identifier for a cleaner card layout, made fund titles clickable links to the fund overview, and swapped the green colour scheme to match the system&rsquo;s red primary palette. In the sidebar, items previously marked &ldquo;New&rdquo; have been moved to the standard under-development indicator for consistency, with only Pooled Funds retaining a &ldquo;New&rdquo; badge.",
      "changes": [
        "<b>Balanced Table Layouts</b>",
        "&nbsp;&nbsp;All four data tables (Activities, Transactions, Budgets, Planned Disbursements) now use <code>table-layout: fixed</code> with explicit <code>&lt;colgroup&gt;</code> column widths",
        "&nbsp;&nbsp;Title/Activity column has no fixed width and stretches to fill remaining space",
        "&nbsp;&nbsp;Numeric and date columns get narrower fixed widths (110&ndash;140 px) to prevent wasted space",
        "&nbsp;&nbsp;Checkbox and Actions columns locked at 48 px",
        "&nbsp;&nbsp;New CSS class <code>data-table-balanced</code> in <code>globals.css</code> with shared styles for all tables",
        "<b>Edge-to-Edge Row Hover</b>",
        "&nbsp;&nbsp;Added an 8 px filler column at the right edge of every table so hover highlights extend to the scroll container boundary",
        "&nbsp;&nbsp;Filler cells marked <code>aria-hidden</code> for accessibility",
        "&nbsp;&nbsp;Expanded-row <code>colSpan</code> increased by one to account for the new filler column",
        "<b>Sankey Chart Improvements (Pooled Funds)</b>",
        "&nbsp;&nbsp;Third tier (child activities) now only renders when at least one child has a non-zero disbursement value",
        "&nbsp;&nbsp;API filters out children with zero disbursements so the chart never shows empty nodes",
        "&nbsp;&nbsp;Hover tooltips on flow links showing source &rarr; target name and dollar amount (Contribution or Disbursement)",
        "&nbsp;&nbsp;Invisible wider hit-area paths behind each link for easier mouse targeting",
        "&nbsp;&nbsp;Colour palette updated from green to red shades matching the system primary colour",
        "<b>Pooled Funds Page Polish</b>",
        "&nbsp;&nbsp;Fund titles are now clickable links to the fund overview page",
        "&nbsp;&nbsp;Status badge repositioned from the actions row to below the IATI identifier for a tidier card layout",
        "&nbsp;&nbsp;Utilisation bar colours updated: Pale Slate track (<code>#cfd0d5</code>) with Blue Slate progress (<code>#4c5568</code>)",
        "&nbsp;&nbsp;Header icon colour updated to primary red",
        "&nbsp;&nbsp;Pooled fund type toggle image set to grayscale",
        "<b>Sidebar Navigation Cleanup</b>",
        "&nbsp;&nbsp;Replaced all <code>isNew</code> badges (Atlas, Reports, SDGs, Sectors, Policy Markers, Working Groups, Library, Build History) with standard <code>underDevelopment</code> indicator",
        "&nbsp;&nbsp;Pooled Funds retains a &ldquo;New&rdquo; badge using the <code>Badge</code> component with <code>variant=&ldquo;success&rdquo;</code>",
        "&nbsp;&nbsp;Removed inline green background style in favour of the shared Badge component"
      ]
    },
    {
      "version": "2.15.0",
      "date": "2026-02-23",
      "narrativeSummary": "We tidied up the tables across æther so they feel more polished and consistent. Previously, the action menu on the activity list used a custom animated component that caused the kebab button to sit out of alignment with the rest of the row — when you hovered over a row the highlight would stop short, leaving an awkward white gap on the right. We replaced that menu with the same straightforward dropdown used elsewhere in the system, removed the now-unnecessary Actions column header from both the Activities and Transactions tables, and made sure that hovering over any row in any table — Activities, Transactions, Budgets, or Planned Disbursements — highlights the entire row edge to edge. Small details, but they add up to a cleaner, more trustworthy interface.",
      "changes": [
        "<b>Activity Action Menu Rebuilt</b>",
        "&nbsp;&nbsp;Replaced custom <code>bloom-menu</code> animated component with standard <code>DropdownMenu</code> (same pattern as Transactions table)",
        "&nbsp;&nbsp;Fixes alignment issue where the kebab button sat out of line with column headers",
        "&nbsp;&nbsp;Export sub-menu preserved with XML, PDF, and Excel options",
        "<b>Actions Column Cleanup</b>",
        "&nbsp;&nbsp;Removed &ldquo;Actions&rdquo; column header text from Activities table &mdash; kebab button renders without a header label",
        "&nbsp;&nbsp;Removed &ldquo;Actions&rdquo; column header text from Transactions table for consistency",
        "&nbsp;&nbsp;Removed <code>actions</code> from column configuration in both Activities and Transactions column definitions",
        "<b>Full-Width Row Hover Highlights</b>",
        "&nbsp;&nbsp;Added <code>[&amp;:hover&gt;td]:bg-muted/50</code> to the base <code>TableRow</code> component so every cell receives the highlight background on hover",
        "&nbsp;&nbsp;Applies globally to all tables using the shared <code>Table</code> component: Transactions, Budgets, and Planned Disbursements",
        "&nbsp;&nbsp;Activities table also updated with matching <code>[&amp;:hover&gt;td]:bg-muted</code> on its custom row element"
      ]
    },
    {
      "version": "2.14.0",
      "date": "2026-02-22",
      "narrativeSummary": "This update prepares the system for pooled and trust funds: activities can now be marked as pooled funds and linked to child activities, with seed data to demonstrate the flow of contributions and disbursements. On the Aid Effectiveness side, each dropdown option can be linked to responsible ministries, making it easier to see which government bodies own which choices. Seed data for all four Aid Effectiveness dropdown categories has been added so countries can go live with realistic options for national plans, results frameworks, accountability, and capacity development.",
      "changes": [
        "<b>Pooled Fund Support</b>",
        "&nbsp;&nbsp;New <code>is_pooled_fund</code> column on <code>activities</code> to mark activities as pooled/trust funds that receive contributions and disburse to child activities",
        "&nbsp;&nbsp;Index on <code>is_pooled_fund</code> for efficient filtering",
        "&nbsp;&nbsp;Seed script for pooled fund test data: one parent fund and three child activities with contributions and disbursements",
        "<b>Aid Effectiveness — Responsible Ministries</b>",
        "&nbsp;&nbsp;New <code>responsible_ministries</code> JSONB column on <code>aid_effectiveness_options</code>",
        "&nbsp;&nbsp;Junction table <code>ae_option_ministries</code> linking options to <code>budget_classifications</code> (ministries)",
        "&nbsp;&nbsp;RLS policies for select, insert, update, delete on <code>ae_option_ministries</code>",
        "<b>Aid Effectiveness Seed Data</b>",
        "&nbsp;&nbsp;Seed script populates all four Aid Effectiveness dropdown categories with GPEDC-aligned options",
        "&nbsp;&nbsp;Categories: National Development Plans, Government Results Frameworks, Accountability Frameworks, Capacity Development from National Plan"
      ]
    },
    {
      "version": "2.13.0",
      "date": "2026-02-21",
      "changes": [
        "<b>Aid Effectiveness Survey Overhaul</b>",
        "&nbsp;&nbsp;All 30+ boolean fields converted from checkboxes to three distinct input types: Yes/No radio buttons, country-specific dropdowns, and multi-option dropdowns with granular answer choices",
        "&nbsp;&nbsp;Four country-specific dropdown fields (<code>includedInNationalPlan</code>, <code>linkedToGovFramework</code>, <code>mutualAccountabilityFramework</code>, <code>capacityDevFromNationalPlan</code>) populated from admin-configurable options per country",
        "&nbsp;&nbsp;Five multi-option dropdown fields with structured answer scales (e.g. &ldquo;Formal structured&rdquo;, &ldquo;Informal&rdquo;, &ldquo;Information sharing only&rdquo;, &ldquo;Not consulted&rdquo;)",
        "&nbsp;&nbsp;Per-field evidence document uploads &mdash; attach PDF, DOC, XLS, or image files to 12 key survey fields, stored in Supabase Storage",
        "&nbsp;&nbsp;New <code>isPositiveValue()</code> helper centralises affirmative/negative value detection across all Aid Effectiveness APIs",
        "&nbsp;&nbsp;All five dashboard API routes updated to handle string-based field values and dropdown compliance scoring",
        "&nbsp;&nbsp;Database migration converts existing boolean values to string equivalents with full backward compatibility",
        "<b>Aid Effectiveness Admin Panel</b>",
        "&nbsp;&nbsp;New CRUD management interface for country-specific dropdown options under System Settings",
        "&nbsp;&nbsp;Tabbed categories for the four configurable fields with add, edit, delete, sort ordering, and active/inactive toggling",
        "&nbsp;&nbsp;New <code>/api/admin/aid-effectiveness-options</code> endpoints (GET, POST, PUT, DELETE) with category validation",
        "&nbsp;&nbsp;Database migration: <code>aid_effectiveness_options</code> table with unique constraint, indexes, triggers, and RLS policies",
        "<b>Dialog-Based Editors</b>",
        "&nbsp;&nbsp;Results tab: Add Result, Edit Result, Add Indicator, Edit Indicator, and Add Period forms all converted from inline cards to scrollable Dialog modals",
        "&nbsp;&nbsp;Countries &amp; Regions tab: Add allocation form converted to a Dialog modal with auto-defaulting first allocation to 100%",
        "&nbsp;&nbsp;Focal Points tab: inline user search panel replaced with compact button and new <code>AssignFocalPointModal</code> dialog",
        "&nbsp;&nbsp;Add Indicator form refactored from <code>Card</code> to <code>Dialog</code> component with <code>open</code> prop control",
        "<b>Dashboard Chart View Toggles</b>",
        "&nbsp;&nbsp;All three hero visualisation cards (Budgets, Planned Disbursements, Transactions) now support bar, line, and table view modes",
        "&nbsp;&nbsp;View toggle available in both compact card and expanded modal views",
        "&nbsp;&nbsp;Transactions chart supports stacked bar mode for multi-type comparison",
        "<b>Dashboard Map Enhancements</b>",
        "&nbsp;&nbsp;New 2D/3D view toggle with 60&deg; pitch and &minus;20&deg; bearing for perspective view",
        "&nbsp;&nbsp;Map default centre now derived from the system home country setting instead of hardcoded coordinates",
        "&nbsp;&nbsp;Sector filter enriched with per-sector activity counts and option to hide empty sectors",
        "&nbsp;&nbsp;Organisation markers now display acronym and logo from enriched API data",
        "<b>Glass-Morphism Navigation</b>",
        "&nbsp;&nbsp;Top navigation bar updated to semi-transparent <code>bg-white/60 backdrop-blur-md</code> for a frosted-glass effect",
        "&nbsp;&nbsp;Activity editor and Organisation editor footers updated with matching glass-morphism styling",
        "<b>Organisation UI Improvements</b>",
        "&nbsp;&nbsp;IATI ID badge and copy button moved inline with organisation name on both card and table views",
        "&nbsp;&nbsp;Organisation list view consolidates name, acronym (in parentheses), and IATI ID into a single compact row",
        "&nbsp;&nbsp;Organisation profile page: removed &ldquo;First activity&rdquo; date from stats bar for cleaner layout",
        "&nbsp;&nbsp;Organisation form fields expanded to full width; save indicators added to Location Represented and Organisation Type",
        "&nbsp;&nbsp;Editor navigation now uses <code>window.history.replaceState()</code> instead of Next.js router for smoother section switching",
        "<b>Save Indicator Polish</b>",
        "&nbsp;&nbsp;New save indicators on planned start/end date descriptions, capital/recurrent spend, and humanitarian toggle fields",
        "&nbsp;&nbsp;Organisation editor: existing field values now show green saved state on initial load",
        "<b>Rolodex Enhancements</b>",
        "&nbsp;&nbsp;Copy-to-clipboard button on email addresses in both table view and person cards",
        "&nbsp;&nbsp;Visual feedback: <code>Copy</code> icon transitions to green <code>Check</code> icon after copying"
      ]
    },
    {
      "version": "2.12.0",
      "date": "2026-02-20",
      "changes": [
        "<b>Guided Spotlight Tours</b>",
        "&nbsp;&nbsp;New interactive page tours powered by <code>react-joyride</code> &mdash; spotlight overlays walk first-time users through each page section",
        "&nbsp;&nbsp;Six pre-seeded tours: Dashboard Overview, Activity List, Activity Editor, Transactions, Organisation Profile, and Bulk Import",
        "&nbsp;&nbsp;Tour button added to the top navigation bar &mdash; click to replay the current page&rsquo;s tour at any time",
        "&nbsp;&nbsp;Tours auto-start on first visit; completion and dismissal tracked per-user via <code>user_tour_completions</code> table",
        "&nbsp;&nbsp;Tour steps stored in the database with locale support for future i18n, role filtering, and admin-editable content",
        "&nbsp;&nbsp;<code>data-tour</code> target attributes added across 30+ components on Dashboard, Activities, Transactions, Calendar, IATI Import, and Activity Editor pages",
        "&nbsp;&nbsp;API routes for fetching tours by route, recording completions, and resetting tour progress",
        "&nbsp;&nbsp;Database migration: <code>tours</code>, <code>tour_steps</code>, and <code>user_tour_completions</code> tables with RLS policies",
        "<b>Calendar &mdash; Week, Day &amp; Year Views</b>",
        "&nbsp;&nbsp;View toggle redesigned as a segmented button bar with Year / Month / Week / Day options (replaces old Month/List dropdown)",
        "&nbsp;&nbsp;Week and Day views powered by FullCalendar <code>timeGridPlugin</code> with time slot rows from 06:00&ndash;22:00",
        "&nbsp;&nbsp;Red &ldquo;now indicator&rdquo; line shows current time in week and day views",
        "&nbsp;&nbsp;New <code>CalendarEventHeatmap</code> component for Year view &mdash; GitHub-style heat grid of daily event density",
        "&nbsp;&nbsp;Heatmap day click drills down to Day view, auto-navigating FullCalendar to the selected date",
        "&nbsp;&nbsp;Clicking a time slot in Week or Day view opens the new-event modal pre-filled with that date",
        "<b>Toast &amp; Field Name Humanisation</b>",
        "&nbsp;&nbsp;New <code>humanizeFieldName()</code> utility with 40+ explicit snake_case-to-label mappings (e.g. <code>organisation_type</code> &rarr; &ldquo;Organisation Type&rdquo;)",
        "&nbsp;&nbsp;All autosave toasts now display human-readable field names instead of raw column names",
        "&nbsp;&nbsp;Applied across <code>use-organization-autosave</code>, <code>use-working-group-autosave</code>, <code>use-supabase-field-update</code>, and <code>toast-manager</code>",
        "&nbsp;&nbsp;Optional <code>displayName</code> override on organisation and working-group autosave hooks for custom labels",
        "<b>UI Polish</b>",
        "&nbsp;&nbsp;Countries &amp; Regions table: edit/delete buttons converted from <code>Button</code> components to native <code>&lt;button&gt;</code> elements with title attributes for accessibility",
        "&nbsp;&nbsp;Organisation form: acronym wand button wrapper repositioned for better alignment inside the input field"
      ]
    },
    {
      "version": "2.11.0",
      "date": "2026-02-19",
      "changes": [
        "<b>Dashboard Overhaul</b>",
        "&nbsp;&nbsp;Hero cards re-ordered with Budgets &amp; Planned Disbursements prominent in a wide 2-column span; every card now has a help tooltip explaining the metric",
        "&nbsp;&nbsp;Transaction chart switched from counts to USD values with formatted currency totals",
        "&nbsp;&nbsp;Sector chart replaced from donut/pie to stacked horizontal bar showing planned-disbursement breakdown across top 8 sectors",
        "&nbsp;&nbsp;All chart tooltips redesigned as HTML tables with column headers (Year, Amount, Type)",
        "&nbsp;&nbsp;Recency cards now show creator/editor profiles (name, job title, department) and rejection reasons on validation events",
        "&nbsp;&nbsp;Portfolio summary labels clarified to &ldquo;Sum of budgets (USD)&rdquo;, &ldquo;Planned total (USD)&rdquo;, &ldquo;Committed total (USD)&rdquo;, etc.",
        "&nbsp;&nbsp;Portfolio loading state upgraded from spinner to skeleton layout matching the final UI",
        "&nbsp;&nbsp;Actions Required panel colour-neutralised to uniform slate palette",
        "<b>Notifications Redesign</b>",
        "&nbsp;&nbsp;Standalone <code>/notifications</code> page retired &mdash; notifications now live inside the Dashboard as a dedicated tab",
        "&nbsp;&nbsp;Layout switched from tabbed view to side-by-side two-column grid (Mentions &amp; System in parallel)",
        "&nbsp;&nbsp;Archive and Delete actions added to each notification item with optimistic UI updates",
        "&nbsp;&nbsp;New PATCH and DELETE API endpoints for archiving and permanently removing notifications",
        "&nbsp;&nbsp;Pagination simplified to minimal &ldquo;Page X of Y&rdquo; with prev/next arrows",
        "<b>Calendar Heatmap &mdash; Fiscal Year Support</b>",
        "&nbsp;&nbsp;New <code>fiscalYearConfig</code> prop drives year-range calculations from the organisation&rsquo;s configured financial year",
        "&nbsp;&nbsp;Year-type dropdown (Calendar Year / Financial Year) replaces the old view-toggle buttons",
        "&nbsp;&nbsp;Timeline and Monthly Summary views removed &mdash; heatmap grid is now the single view",
        "&nbsp;&nbsp;Colour scheme simplified to single-intensity Cool Steel scale",
        "<b>Rich Text Editors</b>",
        "&nbsp;&nbsp;Organisation Description field upgraded from plain textarea to rich text editor with formatting support",
        "&nbsp;&nbsp;New Activity page: Objectives, Target Groups, and Other description fields upgraded to rich text editors",
        "<b>Organisation Form Enhancements</b>",
        "&nbsp;&nbsp;New <b>Default Financial Year</b> dropdown allowing organisations to select their fiscal year type",
        "&nbsp;&nbsp;Help tooltips added to all major fields: Name, Acronym, IATI Identifier, Organisation Type, Residency, Currency, Language",
        "&nbsp;&nbsp;Field layout reorganised &mdash; IATI Identifier moved inline with Name/Acronym; Type and Residency share a row",
        "<b>Data Clinic Validation</b>",
        "&nbsp;&nbsp;Rule sections now conditionally rendered &mdash; only categories with issues are displayed",
        "&nbsp;&nbsp;Edit buttons changed to icon-only pencil; success state uses neutral slate styling",
        "<b>Results Framework</b>",
        "&nbsp;&nbsp;Save Result and Save Baseline buttons now include a disk icon for visual clarity",
        "&nbsp;&nbsp;All edit and delete icons standardised across indicators, periods, and baselines",
        "<b>UI Polish</b>",
        "&nbsp;&nbsp;<code>Edit3</code>/<code>FileEdit</code> icons replaced with <code>Pencil</code> across 40+ components with consistent ring-bordered styling",
        "&nbsp;&nbsp;<code>Trash2</code> icons standardised to <code>text-red-500</code> across all delete actions",
        "&nbsp;&nbsp;&ldquo;(Optional)&rdquo; labels removed from field labels site-wide",
        "&nbsp;&nbsp;Manual Refresh buttons removed from Notifications and Tasks panels",
        "&nbsp;&nbsp;Bookmarked Activities table simplified &mdash; Activity Status and Publication Status columns removed",
        "&nbsp;&nbsp;Recency cards converted to <code>&lt;a&gt;</code> tags for proper link semantics and open-in-new-tab support",
        "&nbsp;&nbsp;Skeleton loading states replace spinners in Portfolio, Notifications, and Dashboard panels"
      ]
    },
    {
      "version": "2.10.0",
      "date": "2026-02-18",
      "changes": [
        "<b>Theme Token Migration</b>",
        "&nbsp;&nbsp;Replaced hardcoded Tailwind colour classes (<code>bg-gray-100</code>, <code>text-slate-600</code>, etc.) with semantic design tokens (<code>bg-muted</code>, <code>text-muted-foreground</code>) across 80+ files",
        "&nbsp;&nbsp;Prepares the entire UI for dark mode support and consistent theming",
        "<b>Organisation Editor Redesign</b>",
        "&nbsp;&nbsp;Merged Branding tab into General &mdash; logo and banner uploads now appear inline on the main form",
        "&nbsp;&nbsp;Organisation Type field converted to searchable dropdown with full IATI organisation-type codelist",
        "&nbsp;&nbsp;Acronym field now includes auto-generate wand button (same as Activity Editor)",
        "&nbsp;&nbsp;Removed UUID display field &mdash; tab count reduced from 7 to 6",
        "<b>Humanitarian Scope Modal</b>",
        "&nbsp;&nbsp;Replaced inline humanitarian scope form with a dedicated Add / Edit modal dialog",
        "&nbsp;&nbsp;New <code>HumanitarianScopeModal</code> component with cleaner field layout and validation",
        "&nbsp;&nbsp;Humanitarian tab now features a dove illustration empty state",
        "<b>Sector &amp; Geography Level Toggles</b>",
        "&nbsp;&nbsp;Activity-level and Transaction-level toggle cards now display descriptive background images instead of placeholder text",
        "&nbsp;&nbsp;Five new illustration assets for sector, geography, and humanitarian sections",
        "<b>View Toggle Icons</b>",
        "&nbsp;&nbsp;Removed text labels from view toggle buttons across 15+ list pages &mdash; now icon-only for a cleaner toolbar",
        "<b>Sector Allocation Form</b>",
        "&nbsp;&nbsp;Transaction-mode sector card now shows a disabled overlay explaining allocation is managed per-transaction",
        "&nbsp;&nbsp;Improved wording and layout for activity-level percentage allocation",
        "<b>Countries &amp; Regions Alert</b>",
        "&nbsp;&nbsp;Redesigned the percentage allocation warning with amber styling and <code>AlertTriangle</code> icon",
        "<b>UI Polish</b>",
        "&nbsp;&nbsp;SDG icons now use grayscale-to-colour hover transition",
        "&nbsp;&nbsp;Organisation banner upload height increased from <code>h-40</code> to <code>h-48</code>",
        "&nbsp;&nbsp;Feedback modal priority icons unified to <code>text-muted-foreground</code>",
        "&nbsp;&nbsp;IATI import and search badges migrated to semantic theme tokens"
      ]
    },
    {
      "version": "2.9.0",
      "date": "2026-02-17",
      "changes": [
        "<b>GPEDC Branding &amp; Dashboard</b>",
        "&nbsp;&nbsp;Aid Effectiveness Dashboard and Form headers styled with official GPEDC banner background",
        "&nbsp;&nbsp;KPI cards use GPEDC banner crops with white text overlay",
        "&nbsp;&nbsp;All chart colours updated from slate palette to GPEDC orange (<code>#F37021</code>): radar, bar, pie, and progress charts",
        "&nbsp;&nbsp;Dashboard tabs now use responsive two-column grid layout",
        "&nbsp;&nbsp;Filter panel labels and controls styled with white text on banner background",
        "<b>Aid Effectiveness Form</b>",
        "&nbsp;&nbsp;Tooltips replaced with visible inline descriptions below field labels",
        "&nbsp;&nbsp;Checkbox fields redesigned as survey-style stacked list with orange check styling",
        "&nbsp;&nbsp;GPEDC indicator badges updated with orange accent colour",
        "&nbsp;&nbsp;Section icons unified to neutral slate",
        "<b>Acronym Auto-Generation</b>",
        "&nbsp;&nbsp;New wand button on Acronym field generates initials from the activity title",
        "&nbsp;&nbsp;Skips filler words (of, the, and, for, in, to, etc.) for cleaner acronyms",
        "&nbsp;&nbsp;Available on both New Activity and Activity Editor pages",
        "<b>Role Labels</b>",
        "&nbsp;&nbsp;Development Partner tiers renamed from &ldquo;Data Submission&rdquo; / &ldquo;Review &amp; Approval&rdquo; to &ldquo;Development Partner &ndash; Tier 1&rdquo; / &ldquo;Tier 2&rdquo;",
        "&nbsp;&nbsp;Government Partner tiers now use consistent &ldquo;Government Partner &ndash; Tier 1 / Tier 2&rdquo; format",
        "&nbsp;&nbsp;Rolodex API now resolves role display labels instead of showing raw role keys",
        "<b>View Toggle Standardisation</b>",
        "&nbsp;&nbsp;Table view button moved to first position (left) across all list pages: Library, Organisations, Partners, Working Groups, Rolodex, Contacts, Locations, Tasks, Linked Activities, Sectors, and Policy Markers",
        "<b>Partners Page</b>",
        "&nbsp;&nbsp;Removed summary metric cards (Bilateral, Multilateral, Other, Custom Groups) for a cleaner layout",
        "&nbsp;&nbsp;Page now auto-expands all country groups and organisations on load with batched activity fetching",
        "&nbsp;&nbsp;Partner group cards now display banner images and logos",
        "<b>Linked Activities Graph</b>",
        "&nbsp;&nbsp;Disabled scroll-wheel zoom to prevent page scroll hijacking",
        "&nbsp;&nbsp;Added explicit +/&minus; zoom buttons for controlled graph navigation",
        "<b>Empty States &amp; UI Polish</b>",
        "&nbsp;&nbsp;Transactions empty state redesigned with <code>ArrowRightLeft</code> icon and cleaner messaging",
        "&nbsp;&nbsp;Budgets empty state added with <code>Wallet</code> icon",
        "&nbsp;&nbsp;Published badge updated to solid green background with white text",
        "&nbsp;&nbsp;Publication toggle switch changed from gray to green",
        "&nbsp;&nbsp;Form select placeholders unified to <code>text-muted-foreground</code>"
      ]
    },
    {
      "version": "2.8.0",
      "date": "2026-02-17",
      "changes": [
        "<b>Aid Effectiveness Dashboard</b>",
        "&nbsp;&nbsp;Redesigned filter panel with reporting organisation selector (logos, names, acronyms) and hierarchical sector filter",
        "&nbsp;&nbsp;Custom fiscal/calendar year support with visual year-range grid selector",
        "&nbsp;&nbsp;Help tooltips on all 15+ KPI cards and chart sections explaining each metric",
        "&nbsp;&nbsp;Consolidated from 5 tabs to 4 &mdash; overview content merged into Ownership and Transparency tabs",
        "&nbsp;&nbsp;KPI card styling unified to <code>bg-surface-muted</code> with borderless design",
        "<b>Transaction Auto-Defaulting</b>",
        "&nbsp;&nbsp;Automatic provider/receiver organisation assignment based on IATI 2.03 transaction direction",
        "&nbsp;&nbsp;Incoming transactions (types 1, 9, 11, 13) auto-fill receiver with your organisation",
        "&nbsp;&nbsp;Outgoing transactions (types 2&ndash;8, 10, 12) auto-fill provider with your organisation",
        "&nbsp;&nbsp;&ldquo;Auto-filled&rdquo; badge displayed when org is automatically set; manual changes are preserved",
        "&nbsp;&nbsp;Provider/receiver cards highlight blue (outgoing) or green (incoming) when matching your org",
        "<b>Performance &amp; Disk IO Reduction</b>",
        "&nbsp;&nbsp;Middleware: replaced <code>getUser()</code> with <code>getSession()</code> &mdash; validates JWT locally instead of querying Supabase on every request",
        "&nbsp;&nbsp;Activity comments polling: 30s &rarr; 60s",
        "&nbsp;&nbsp;Notification bell polling: 30s &rarr; 120s",
        "&nbsp;&nbsp;Bulk import status polling: 2s &rarr; 5s",
        "&nbsp;&nbsp;Comments drawer auto-refresh: 30s &rarr; 60s",
        "<b>Activity Editor</b>",
        "&nbsp;&nbsp;Actual date narrative sections auto-collapse when their date field becomes disabled (e.g. status change)",
        "&nbsp;&nbsp;Disabled date narrative toggle buttons now show gray text with <code>cursor-not-allowed</code>",
        "&nbsp;&nbsp;API validation: prevents saving actual date narratives without a corresponding date value",
        "<b>Bug Fixes</b>",
        "&nbsp;&nbsp;Fixed middleware 5-second timeout race condition that prevented proper token refresh",
        "&nbsp;&nbsp;Fixed orphaned narrative descriptions being saved without corresponding actual dates"
      ]
    },
    {
      "version": "2.7.0",
      "date": "2026-02-15",
      "changes": [
        "<b>Aid Effectiveness Dashboard</b>",
        "&nbsp;&nbsp;Complete redesign aligned with GPEDC indicators using built-in Recharts visualisations",
        "&nbsp;&nbsp;New tabs: Ownership &amp; Systems, Transparency &amp; Accountability, Engagement &amp; Gender, GPEDC Compliance",
        "&nbsp;&nbsp;Radar chart for section scores, pie chart for aid tying, bar charts for performance breakdown",
        "&nbsp;&nbsp;Year selector dropdown replacing date range picker, with donor/sector/country filters",
        "&nbsp;&nbsp;KPI cards: Overall Score, Compliance Rate, Gov Ownership, Untied Aid, Avg Outcomes",
        "&nbsp;&nbsp;Dashboard now queries Supabase directly with <code>useMemo</code> caching instead of dedicated API endpoint",
        "<b>Aid Effectiveness Form (GPEDC Alignment)</b>",
        "&nbsp;&nbsp;Form restructured to map directly to GPEDC indicators 1&ndash;8",
        "&nbsp;&nbsp;4 new sections: Transparency &amp; Reporting (GPEDC 4), Mutual Accountability (GPEDC 7), Civil Society &amp; Private Sector (GPEDC 2&amp;3), Gender Equality (GPEDC 8)",
        "&nbsp;&nbsp;20+ new form fields across all sections with GPEDC indicator badges",
        "&nbsp;&nbsp;Multi-year financing agreement checkbox added to Predictability section",
        "<b>Meeting Location Picker</b>",
        "&nbsp;&nbsp;New <code>LocationPicker</code> component with interactive MapLibre GL map for meeting venues",
        "&nbsp;&nbsp;Reverse geocoding API at <code>/api/geocode/reverse</code> converts coordinates to addresses",
        "&nbsp;&nbsp;Latitude/longitude stored on meeting records and displayed with map pin icon",
        "&nbsp;&nbsp;Meeting modal redesigned with sticky header/footer and scrollable content",
        "<b>Organisations Table</b>",
        "&nbsp;&nbsp;Drag-and-drop column reordering with <code>DndColumnProvider</code> integration",
        "&nbsp;&nbsp;Column renames: Name &rarr; Organization Name, Active Projects &rarr; Reported, Total Funding &rarr; Funding, Created &rarr; Date Created",
        "&nbsp;&nbsp;New <code>residency</code> sort option and column",
        "&nbsp;&nbsp;Cell rendering refactored from inline JSX to <code>cellMap</code> object for maintainability",
        "<b>Chart Colour Unification</b>",
        "&nbsp;&nbsp;All 6 aid effectiveness chart components updated from varied colours to consistent slate palette",
        "&nbsp;&nbsp;Radar, bar, pie, and progress charts now use unified <code>#334155</code> tones",
        "&nbsp;&nbsp;Summary cards, badges, and compliance text standardised to slate variations",
        "<b>Working Groups</b>",
        "&nbsp;&nbsp;Meetings section: replaced Minutes field with Description, added location coordinates support",
        "&nbsp;&nbsp;Removed Activities section from Working Group editor (simplified scope)",
        "&nbsp;&nbsp;Editor navigation: removed Connections section group",
        "<b>Sidebar Navigation</b>",
        "&nbsp;&nbsp;Navigation updates for new and restructured pages"
      ]
    },
    {
      "version": "2.6.0",
      "date": "2026-02-15",
      "changes": [
        "<b>Draggable Column Reordering</b>",
        "&nbsp;&nbsp;Drag-and-drop column reordering on Activities, Transactions, Budgets, and Planned Disbursements tables",
        "&nbsp;&nbsp;Column order saved to localStorage and persists across sessions",
        "&nbsp;&nbsp;New reusable <code>useColumnOrder</code> hook, <code>DndColumnProvider</code>, and <code>SortableTableHeader</code> components",
        "&nbsp;&nbsp;Grip handle icon appears on hover &mdash; locked columns (checkbox, actions) cannot be moved",
        "<b>Activity View Tracking</b>",
        "&nbsp;&nbsp;Unique view counter on activity detail pages &mdash; records one view per user per activity",
        "&nbsp;&nbsp;Eye icon badge shows total unique viewers with tooltip",
        "&nbsp;&nbsp;New <code>/api/activities/[id]/views</code> endpoint with upsert logic",
        "&nbsp;&nbsp;Database migration: <code>activity_views</code> table with trigger-based count synchronisation",
        "<b>Working Groups Editor</b>",
        "&nbsp;&nbsp;Working Group General section redesigned with banner/icon upload and group type selector",
        "&nbsp;&nbsp;Meetings section expanded with full CRUD: create, edit, delete, status transitions, and agenda notes",
        "&nbsp;&nbsp;Members section improved with role assignment and member management",
        "&nbsp;&nbsp;Editor navigation updated with meeting and document counts",
        "<b>Organisation Profiles</b>",
        "&nbsp;&nbsp;New <code>residency_status</code> field on organisations &mdash; Resident (teal) / Non-Resident (amber) badge display",
        "&nbsp;&nbsp;Organisation detail page now fetches <code>default_finance_type</code>, <code>disbursements</code>, <code>commitments</code>, <code>expenditures</code> per activity",
        "&nbsp;&nbsp;Organisation editor navigation updated with improved section grouping",
        "&nbsp;&nbsp;Org form content expanded with additional fields",
        "<b>Transaction &amp; Budget Tables</b>",
        "&nbsp;&nbsp;Transaction table refactored from 200+ lines of conditional headers to map-based <code>DndColumnProvider</code> pattern",
        "&nbsp;&nbsp;Budget table integrated with column reordering, reporting org logo display, and copy-to-clipboard for titles/IATI IDs",
        "&nbsp;&nbsp;Transaction type summary cards now correctly use <code>value_usd</code> field with proper fallback chain",
        "&nbsp;&nbsp;Reporting Org column moved from hidden details group to default visible in budgets",
        "<b>UI &amp; Icon Standardisation</b>",
        "&nbsp;&nbsp;Replaced deprecated <code>Grid3X3</code> icon with <code>LayoutGrid</code> across Activities, Organisations, Library, and Rolodex pages",
        "&nbsp;&nbsp;Replaced <code>List</code> icon with <code>Table</code> icon for table view toggles across 8+ pages",
        "&nbsp;&nbsp;Table header backgrounds standardised to <code>bg-surface-muted</code> across all skeleton loaders and data tables",
        "&nbsp;&nbsp;Task modals (Create &amp; Edit) refactored with fixed header/footer and scrollable content area",
        "<b>API Enhancements</b>",
        "&nbsp;&nbsp;Activity search now returns <code>recipient_countries</code> array and full <code>reporting_org</code> object with logo",
        "&nbsp;&nbsp;Organisation list API now includes <code>residency_status</code> field",
        "&nbsp;&nbsp;Budgets list API now includes organisation <code>logo</code> for reporting org display",
        "<b>Bug Fixes &amp; Polish</b>",
        "&nbsp;&nbsp;Transaction document upload component cleaned up with improved error handling",
        "&nbsp;&nbsp;Contact form and location modal refinements",
        "&nbsp;&nbsp;Library document modals updated with consistent styling",
        "&nbsp;&nbsp;Activity combobox improved with better multi-line support and height handling"
      ]
    },
    {
      "version": "2.5.0",
      "date": "2026-02-14",
      "changes": [
        "--- Working Groups ---",
        "New Working Group editor with autosave across 5 sections: General, Members, Meetings, Documents, Activities",
        "Create and edit working groups at /working-groups/new and /working-groups/[id]/edit",
        "New APIs for working group members, meetings, and documents (CRUD endpoints)",
        "Working group detail page redesigned with Meetings tab showing meeting status and history",
        "Working groups list page with card and table view toggle, group type labels, and create button",
        "8 working group types: Technical, Development Partner, Government, Joint, Issue-Specific, Coordination, Thematic, Sub-Working Group",
        "Member roles expanded: Co-Chair, Deputy Chair, Secretariat with unique badge colors",
        "Calendar event creation now supports linking meetings to working groups",
        "--- UI Components ---",
        "Organization and Activity comboboxes rewritten with native div-based dropdowns replacing Command components",
        "Required field indicators standardized to red dot across all forms (registration, profile, activity editor, calendar, admin)",
        "Popover component fixed for dialog compatibility — popovers inside dialogs no longer break focus management",
        "Table header backgrounds standardized to bg-surface-muted",
        "Activity list hover effects properly scoped with group/title, group/pid, group/iati patterns",
        "Organization card names now clickable links to org profile pages",
        "SDG target selection redesigned with inline badge pills and close buttons",
        "Tags section layout changed from vertical to horizontal with inline add button",
        "--- Transactions ---",
        "Transaction table: dedicated Provider Activity and Receiver Activity columns with acronym, title, and IATI identifier",
        "Transaction API now fetches linked provider and receiver activity details (title, acronym, IATI identifier)",
        "--- Analytics ---",
        "SDG and Sector geographic data now falls back to activity locations when transactions lack recipient country codes",
        "Donor rankings sort by combined commitments + disbursements instead of disbursements only",
        "Donor ranking filter broadened to include any organization with financial activity",
        "--- Activity Editor ---",
        "Help text added inline for XML Import and Government Readiness Checklist sections",
        "Enhanced Activity Editor with improved section grouping and navigation",
        "Dashboard hero visualization cards updated with improved layout",
        "--- Bug Fixes ---",
        "Fixed popover positioning inside dialog modals (CSS transform offset calculation)",
        "Fixed state batching in SDG alignment section using functional setState pattern",
        "Date formatting standardized with date-fns format() replacing native toLocaleDateString()"
      ]
    },
    {
      "version": "2.4.0",
      "date": "2026-02-13",
      "changes": [
        "--- Sector & Policy Marker Profiling ---",
        "Completely redesigned Sector profile page with 7 tabs: Overview, Sub-Sectors, Financials, Activities, Donors, Organizations, Geography",
        "New SectorHierarchyBreadcrumb showing group → category → sector navigation path",
        "Sub-sector breakdown with related sectors, allocation percentages, and financial metrics",
        "Sector activities with card/table view toggle, status filters, sort controls, and pagination",
        "Redesigned Policy Marker profile page with 7 tabs including new Significance and Donors tabs",
        "Policy marker significance distribution analysis with activity counts and financial values",
        "Dynamic color theming based on marker type across policy marker profiles",
        "Mini chart cards grid (Funding Trends, Significance/Sub-sector, Top Donors, Geographic Spread) on both profile types",
        "Year-over-year comparison statistics for commitments, disbursements, and expenditures",
        "Donor rankings with contribution type tracking (funding, extending, implementing, accountable)",
        "Interactive geography maps with country rankings table, flag icons, and CSV export",
        "New Policy Markers listing page at /policy-markers",
        "New policy-marker-utils library with icon mapping, significance labels, and color themes",
        "New sector-colors and sector-hierarchy utility libraries",
        "Sectors summary API rewritten with real database queries replacing mock data",
        "Sidebar now shows counts for sectors and policy markers",
        "--- Activity Editor Improvements ---",
        "Added help tooltips to section headings (General, Metadata, Government Inputs, Readiness Checklist)",
        "Other Identifiers field redesigned with hover effects, rich tooltips showing type/owner/codes",
        "Removed UUID field from activity editor (auto-generated, not user-editable)",
        "Section wrapper cards with borders and titles for Metadata, XML-Import, Government, and Readiness sections",
        "--- Performance & Caching ---",
        "Dashboard analytics API: in-memory cache with 5-minute TTL and 20-entry limit",
        "Sidebar counts API: in-memory cache with 5-minute TTL",
        "IATI sync cron: replaced N×M individual COUNT queries with single batched SELECT + client-side counting",
        "Bulk import: batch progress updates every 10 activities instead of every activity (90% fewer DB writes)",
        "Bulk import: pre-fetch policy markers and tags into Maps for O(1) lookups instead of per-activity queries",
        "Policy marker API: parallel Promise.all() queries replacing sequential nested selects",
        "--- Build History ---",
        "Build history page now paginated with configurable page sizes (5/10/15/25 releases)",
        "Page navigation controls with First/Previous/Next/Last buttons",
        "--- Bug Fixes & Polish ---",
        "Date formatting standardized to dd MMM yyyy using date-fns across all date pickers",
        "IATI Sync panel: improved field group layout and sync configuration UI",
        "Transaction action menu: enhanced with better styling and organization",
        "Supabase client: improved error handling and connection management"
      ]
    },
    {
      "version": "2.3.0",
      "date": "2026-02-11",
      "changes": [
        "--- SDG Profiling System ---",
        "New SDG listing page at /sdgs with overview of all 17 Sustainable Development Goals",
        "Completely redesigned SDG profile page with 7 tabs: Overview, Targets, Financials, Activities, Donors, Organizations, Geography",
        "SDG Target Breakdown showing activity count, commitments, and disbursements per target",
        "SDG Donor Rankings with organization logos, commitment/disbursement split, and contribution types",
        "SDG Geography Map with interactive country visualization and ranked country table with CSV export",
        "Year-over-year comparison statistics on SDG metric cards (commitments, disbursements, expenditures)",
        "Activity status breakdown (Pipeline, Implementation, Completion, Closed) on SDG profiles",
        "Card and table view toggle for SDG activities with sort and filter controls",
        "New SDG component library: SDGHeroBanner, SDGMetricCards, SDGTargetBreakdown, SDGDonorRankings, SDGGeographyMap",
        "Enhanced SDG API with target breakdown, donor rankings, geographic distribution, and YoY stats",
        "--- Database Security Hardening ---",
        "Enabled Row Level Security on 40+ database tables to address Supabase Security Advisor findings",
        "Fixed infinite recursion in users table RLS policy that blocked all user queries",
        "Fixed organizations table RLS policy that blocked bulk import from creating organizations",
        "Set search_path on 65+ database functions to prevent search_path hijacking",
        "Moved pg_trgm extension from public to extensions schema",
        "Switched 12 views from SECURITY DEFINER to SECURITY INVOKER",
        "Recreated 2 views to join public.users instead of auth.users (prevents auth data exposure)",
        "Dropped 5 obsolete backup tables that were publicly exposed without RLS",
        "API routes now use admin client to bypass recursive RLS on users and organizations tables",
        "--- IATI Import Improvements ---",
        "Batch import cancellation — cancel button on in-progress imports with graceful shutdown",
        "Import history pagination with configurable page sizes (10/20/50/100)",
        "CSV export for import batch results with full child record details",
        "Delete import history records (super users only, imported activities remain unaffected)",
        "Activity scope classification in preview (National/Regional/Unknown based on recipient data)",
        "New scope filter column in bulk preview table",
        "Conditional d-portal sector enrichment — skips when Datastore provides all percentages",
        "Early termination for d-portal queries when all target activities are matched",
        "Time budget cap (240s) prevents d-portal enrichment from exceeding Vercel limits",
        "Removed redundant d-portal hierarchy enrichment (hierarchy now fetched directly from Datastore)",
        "Sector percentage now fetched directly from IATI Datastore",
        "Added .limit(5000) to unbounded Supabase queries for safety",
        "--- UI & Theme ---",
        "New bg-surface-muted CSS variable replacing hardcoded colors (dark mode ready)",
        "Responsive tab wrapping (flex-wrap) across all pages",
        "Standardized tab icons (h-4 w-4) and added icons to partner profile and search result tabs",
        "Filter icon updated from Filter to SlidersHorizontal across 15+ pages",
        "Increased Vercel maxDuration to 300s for IATI fetch and bulk import routes",
        "Updated IATI fetch time estimates to reflect actual performance (~60s per page)",
        "Auto-sync labels updated to remove 'every 24 hours' references"
      ]
    },
    {
      "version": "2.2.0",
      "date": "2026-02-10",
      "changes": [
        "--- Paginated IATI Datastore Fetch ---",
        "Large organisations (e.g. USAID with ~30k activities) now fetch page-by-page instead of a single request, preventing Vercel 300s timeout",
        "Real progress bar for paginated fetches showing page count, activity count, and ETA",
        "Automatic 429 rate-limit retry with exponential backoff and cancel support between pages",
        "New /api/iati/fetch-org-activities/page endpoint for single-page fetches with 60s max duration",
        "Shared datastore-helpers module extracted for reuse across IATI fetch routes",
        "--- Performance & Disk IO Optimization ---",
        "Bulk stats API cache TTL increased from 60s to 1 hour — reduces full table scans on transactions, budgets, and planned disbursements",
        "Sidebar counts API now cached at CDN level for 5 minutes (was zero caching) — eliminates 14 COUNT queries per page navigation",
        "IATI sync cron uses COUNT queries (head:true) instead of fetching all rows from 9 child tables just to count them",
        "Disabled automatic nightly IATI sync cron to reduce disk IO on Micro Supabase instance (manual sync per activity still available)",
        "--- Middleware & Auth Fixes ---",
        "Fixed MIDDLEWARE_INVOCATION_TIMEOUT (504) caused by Supabase getUser() timing out from distant edge regions",
        "Restored Supabase session refresh in middleware with 5-second timeout for graceful degradation",
        "API routes now skip redundant middleware session refresh since they use requireAuth() directly",
        "--- Bug Fixes ---",
        "Added /notifications page to resolve 404 from top nav notification bell link",
        "Fixed PostgREST error on IATI cache query by switching from .single() to .maybeSingle()"
      ]
    },
    {
      "version": "2.1.1",
      "date": "2026-02-09",
      "changes": [
        "Fixed Activities list pagination not responding to user's items-per-page selection (was always showing 20 regardless of dropdown choice)"
      ]
    },
    {
      "version": "2.1.0",
      "date": "2026-02-08",
      "changes": [
        "--- Contact Normalization ---",
        "New normalized contacts table — unique people are stored once and linked to activities via contact_id foreign key",
        "Contact search API now queries the contacts table directly instead of activity_contacts, eliminating duplicate results",
        "Rolodex API refactored to use contacts table — removed manual dedup logic (contactDedupKey, deduplicateActivityContacts) in favor of database-level uniqueness",
        "Rolodex stats endpoint simplified to a single count query on the contacts table",
        "Bulk import pre-fetches all contact references with prefetchContacts() for batch resolution during import",
        "IATI sync service resolves contacts through getOrCreateContact() when syncing contact-info fields",
        "Activity field API resolves contacts through getOrCreateContact() when saving from the editor",
        "New contact-helpers module with getOrCreateContact(), prefetchContacts(), and contactDedupKey()",
        "Activity contacts API joins through contact_id to the contacts table, falling back to activity_contacts columns for pre-migration rows",
        "--- User Preferences & Default Columns ---",
        "New Preferences tab on Profile page for configuring default activity columns",
        "Column preferences grouped by category with select-all toggles per group",
        "Save and Reset to System Defaults buttons for column preferences",
        "New /api/users/column-preferences endpoint for reading and saving default column selections",
        "Activities list loads user's saved default columns on first visit (before any localStorage override)",
        "Column selector reset button now resets to user's saved defaults instead of system defaults",
        "default_activity_columns field added to users table via migration",
        "--- IATI Data Coverage ---",
        "Datastore fetch now requests 50+ additional IATI fields: related activities, other identifiers, conditions, recipient regions, country budget items, FSS forecasts, CRS loan data, and transaction-level classification overrides",
        "Datastore mapper parses related activities, other identifiers, conditions, recipient regions, country budget items, FSS (Forward Spending Survey), and CRS additional data",
        "Transaction parsing now captures per-transaction aid type, finance type, flow type, tied status, recipient country, and recipient region",
        "ParsedActivity type extended with types for related activities, other identifiers, conditions, recipient regions, country budget items, FSS, CRS data, and lastUpdatedDatetime",
        "--- Bulk Import Preview Enhancements ---",
        "Expanded preview rows now show Other Identifiers with type codes and owner org details",
        "Expanded preview rows now show Recipient Regions with vocabulary and percentage",
        "Expanded preview rows now show Related Activities with relationship type labels",
        "Expanded preview rows now show Conditions with condition type",
        "Expanded preview rows now show Country Budget Items, FSS forecasts, and CRS loan data",
        "Last updated datetime shown in expanded preview for change detection",
        "--- Activities List Improvements ---",
        "New 'Imported from IRT' column showing whether an activity was created via IRT Import, Quick Add, or Manual entry",
        "IATI sync status badge and icon now only show 'Synced' when auto_sync is actually enabled on the activity",
        "Sync icon (RefreshCw) displayed inline next to activity title for auto-synced activities",
        "--- IATI Sync Fixes ---",
        "IATI Sync panel renamed to 'IATI Link' for clarity",
        "Sync status correctly shows 'Not Synced' when auto-sync is disabled (previously showed stale status)",
        "Disabling auto-sync now resets sync_status to 'pending' and clears last sync time display",
        "Sync status banner shows 'Auto-sync is disabled' instead of 'Never synced' when auto-sync is off",
        "Activity detail page badges now gate sync status display on autoSync flag",
        "--- Navigation & Sidebar ---",
        "IATI Import moved from Operations sidebar section to the Add Activity dropdown as 'Bulk IATI Import'",
        "Add Activity dropdown now has two options: 'Import Single Activity' and 'Bulk IATI Import'",
        "Sidebar counts now include document count (across all document tables) and published FAQ count",
        "Library and FAQ pages now show counts in the sidebar navigation",
        "Activity editor navigation renamed: 'IATI Import' → 'Import Single Activity', 'TOOLS' → 'IATI Tools'",
        "--- FAQ & UI Improvements ---",
        "FAQ page now has pagination with configurable items per page (persisted to localStorage)",
        "FAQ answer truncation threshold increased from 300 to 800 characters for better readability",
        "FAQ 'Show more/less' button restyled from blue to subtle gray",
        "Version badge hover card z-index increased to 9999 to appear above all overlays",
        "Activity editor hides section header on IATI Link tab to prevent duplicate headings",
        "--- Database Migrations ---",
        "Migration: default_activity_columns JSONB field on users table",
        "Migration: contacts table with unique constraint and contact_id foreign key on activity_contacts",
        "FAQ seed data for general usage and activity editor help topics",
        "--- Cleanup ---",
        "Removed verbose console.log statements from Rolodex API, contacts API, and rolodex stats routes",
        "Simplified Rolodex API by removing 100+ lines of manual deduplication code"
      ]
    },
    {
      "version": "2.0.0",
      "date": "2026-02-08",
      "changes": [
        "--- IATI Bulk Import ---",
        "Complete overhaul of IATI Bulk Import wizard with 5-step workflow: Source, Preview, Rules, Import, Results",
        "Pre-fetch server-side Solr filtering by country, hierarchy, and date range — USAID fetch: 56,000 → ~200 activities",
        "Manual 'Fetch Activities' button replaces auto-fetch, with elapsed timer showing M:SS.t format",
        "Preview count API shows matching activity count before fetching data",
        "Recipient Country defaults to system home country from admin settings",
        "Super users can import IATI activities on behalf of any organization via OrganizationCombobox",
        "Advanced preview filters: activity status, hierarchy, aid type, finance type, transactions, budgets — with counts per option",
        "Expanded preview rows show contacts, documents, policy markers, humanitarian scope, tags, and DAC/CRS classification",
        "Copy-to-clipboard buttons for activity title and IATI identifier on hover",
        "Rules step redesigned with horizontal hero cards: Activity Matching, Transaction Handling, Organization Resolution",
        "Auto-sync toggle in Rules step: imported activities checked against IATI Datastore every 24 hours",
        "Import Impact Preview showing create/update/skip/transaction counts before importing",
        "Import now parses and imports contacts (contact-info): organisation, person name, job title, email, phone, website, mailing address",
        "Import now parses and imports documents (document-link): URL, format, title, description, category, language, date",
        "Import now parses and imports policy markers, humanitarian scopes, and tags (including SDG goals/targets)",
        "Import now parses and imports the full IATI results framework: results, indicators, baselines, and periods (14 database tables)",
        "Batch pre-fetch organization resolution reduces N*M database queries to a handful of batch queries",
        "USD conversion rate caching avoids repeated exchange rate API calls during large imports",
        "Import progress updates incrementally per-activity during batch processing instead of only at completion",
        "Import completion triggers a user notification with created/updated/failed counts",
        "Results step shows comprehensive per-activity import details for all 18 child record types",
        "CSV export includes all child record type columns with batch metadata",
        "Import history tab shows detailed per-activity child record counts within batch drill-down",
        "--- IATI Auto-Sync ---",
        "New IATI Sync panel on activity detail pages with sync status banner (green/yellow/gray) and time-based coloring",
        "Per-field auto-sync configuration for 14 field groups (title, description, dates, status, sectors, transactions, etc.)",
        "'Sync Now' button triggers immediate sync with the IATI Datastore",
        "Sync history section with collapsible log entries showing before/after field-level comparisons",
        "Daily cron job automatically syncs all auto-sync-enabled activities via /api/cron/iati-sync",
        "Database trigger marks activities as 'outdated' when users edit synced fields while auto_sync is enabled",
        "--- Library & Document Bookmarks ---",
        "Library page rewritten with three tabs: All Documents, Reading Room (org-level bookmarks), My Library (personal bookmarks)",
        "Card view and table view modes, persisted to localStorage",
        "Bookmark toggle buttons for personal and organization reading room on document cards, tables, and preview modals",
        "Bookmarked Documents component with personal/reading room scopes and 'Added by' attribution",
        "New /api/library/bookmarks endpoint for bookmark CRUD operations with RLS-protected database tables",
        "Pagination with configurable items per page, sort controls, and bulk download/delete actions",
        "--- Sidebar & Navigation ---",
        "Dynamic sidebar counts next to navigation items (activities, transactions, planned disbursements, budgets, organizations, rolodex)",
        "New /api/sidebar-counts endpoint returning live counts from the database",
        "--- Activity Editor ---",
        "Contacts tab updated to handle contacts without person names (IATI contacts with only organisation name)",
        "Sector allocation form supports non-DAC vocabularies via new sector_vocabulary column",
        "Results import route refactored to use new parse-results-xml and results-importer modules",
        "Activity API routes updated with sync-related field handling",
        "--- UI/UX Improvements ---",
        "New SDGIconHover component for SDG icon with hover tooltip",
        "Compact date format dd/MM/yyyy across all date pickers",
        "Improved notification bell with import_completed notification type support",
        "Organization combobox updated with improved loading states and UUID validation",
        "Rolodex person card updated layout and styling",
        "Various styling improvements across conditions tab, countries/regions tab, and transaction components",
        "--- Bug Fixes ---",
        "Fixed super user organization import with proper UUID validation and organization loading",
        "Fixed import progress to update incrementally instead of only at completion",
        "Fixed network connectivity error messages with specific guidance for timeout, DNS, and connectivity issues",
        "Fixed duplicate targetOrgId variable declaration in import route",
        "Fixed useDropdownState to gracefully fall back to local state when context is unavailable",
        "Reduced Vercel maxDuration to 300s to comply with Hobby plan limits",
        "--- Cleanup ---",
        "Deleted 18 backup/duplicate files (46,000+ lines of dead code removed)",
        "Updated .gitignore to prevent future backup files from being tracked",
        "Added 5 database migrations: nullable contact names, import details JSONB, sector vocabulary, IATI sync fields, document bookmarks"
      ]
    },
    {
      "version": "1.18.0",
      "date": "2026-02-06",
      "changes": [
        "IATI Bulk Import now shows estimated import time based on activity count (e.g., '56,000 activities — ~12 minutes')",
        "Progress bar adapts dynamically to actual fetch duration for large organizations",
        "Extended API timeout to 15 minutes for organizations with 50,000+ activities (e.g., USAID)",
        "Quick count query provides instant activity count before full data fetch begins"
      ]
    },
    {
      "version": "1.17.0",
      "date": "2026-02-06",
      "changes": [
        "Super users can now select any organization to import IATI data on their behalf",
        "Organization selector enhanced with two-line layout showing logo, name, IATI ID, type code, and country with flag",
        "IATI Bulk Import country filter matches activities by recipient-country code OR location coordinates within country bounds",
        "IATI Bulk Import hierarchy filter for Level 1 (Parent) and Level 2 (Sub-Activity) activities",
        "IATI Bulk Import country scope filter (All/100%/Regional) for filtering by allocation percentage",
        "IATI Bulk Import progress indicator with 4-phase display during data fetch",
        "IATI Bulk Import Results tab redesigned with monochrome color scheme",
        "Cancel Import button allows returning from import step to rules configuration"
      ]
    },
    {
      "version": "1.16.0",
      "date": "2026-02-05",
      "changes": [
        "Country Emergencies management — admin panel for creating and managing country-identified emergencies (Vocabulary 98)",
        "Emergency searchable dropdown in Humanitarian Scopes for quick emergency selection with auto-populated narratives",
        "IATI Bulk Import wizard for streamlined multi-activity imports from the IATI Datastore",
        "Organization-scoping validation for IATI imports prevents cross-organization data import",
        "New Country/Region tab added to activity editor workflow between Humanitarian and Locations",
        "Next button added for section-to-section navigation without saving in the activity editor",
        "Location table actions redesigned — dropdown menus replaced with inline edit/delete buttons and checkmark indicators",
        "3D/2D view toggle, reset button, and satellite/HOT tile layer options added to location maps",
        "Scroll zoom disabled by default on activity location heatmaps for smoother page scrolling",
        "Participating organizations section redesigned with visual checkmarks for saved entries",
        "Humanitarian scope form improved with 3-column layout, emergency details display, and save indicators",
        "Countries & Regions tables updated with consistent edit icons and checkmark indicators for saved rows",
        "Dialog focus trapping fixed to allow popover interactions (e.g. date pickers) inside modals",
        "Popover components updated with pointer-events-auto for reliable click handling",
        "Humanitarian flag and participating org count now persist correctly from the basic API endpoint"
      ]
    },
    {
      "version": "1.15.0",
      "date": "2026-02-04",
      "changes": [
        "Other Identifiers redesigned with modal-based editing in a compact 3-column grid",
        "Custom Activity Dates redesigned with modal-based editing in a 2-column grid",
        "Sector allocation mode toggle redesigned as visual card-based selector with descriptions",
        "Sector allocation table simplified - removed verbose hover tooltips for cleaner readability",
        "Relaxed sector validation - allocations under 100% no longer trigger warnings",
        "Organization search results now display country flags alongside country names",
        "Sector Sankey chart labels now display as styled badges with improved light-theme tooltips",
        "Humanitarian tab redesigned with fieldset-style bordered layout",
        "Activity Title and Reporting Organisation fields now show saving/saved indicators",
        "Dialog and popover z-index fixes prevent modals from being hidden behind overlays",
        "Dialogs no longer close when interacting with popovers inside them (e.g. date pickers)",
        "Fixed autosave race condition that could overwrite local edits after activity creation",
        "Removed aggressive request cancellation that caused fetch abort errors",
        "Sidebar 'Full Activity Editor' now uses proper link for right-click open-in-new-tab support",
        "Hierarchical sector dropdown headers increased to improved font size for readability"
      ]
    },
    {
      "version": "1.14.0",
      "date": "2026-02-03",
      "changes": [
        "Activity Editor lazy loading - tab data loads on-demand instead of all at once",
        "API request priority queue - saves now take priority over reads, preventing timeout issues",
        "Save operations automatically cancel pending read requests for faster, more reliable saves",
        "Request queue limits concurrent API calls to prevent server overload",
        "Map markers show visual selection state with darker color when clicked",
        "Organization dropdown rewritten with improved scroll behavior",
        "Phone number field supports controlled dropdown state for better form management",
        "Various popover, dialog, and select component fixes for better portal handling"
      ]
    },
    {
      "version": "1.13.0",
      "date": "2026-02-02",
      "changes": [
        "Organization bookmarks - bookmark organizations and view them on your dashboard",
        "Subnational choropleth map - visualize funding distribution across states/regions and townships",
        "Township-level geographic data with detailed boundaries for all of Myanmar",
        "Enhanced subnational breakdown with improved data allocation to administrative levels",
        "Bookmarked Organizations table on dashboard showing your saved organizations",
        "Improved Rolodex filter panel with better organization type filtering",
        "Fixed flood risk zones not rendering on the map",
        "Doubled width of Organization and Sector filter dropdowns for better readability",
        "Added labels above Atlas filter dropdowns for clearer UI hierarchy",
        "Import progress roller showing detailed status during IATI XML imports"
      ]
    },
    {
      "version": "1.12.0",
      "date": "2026-02-01",
      "changes": [
        "OSM Power Grid layer - transmission lines, substations, and power plants from OpenStreetMap",
        "Power lines colored by voltage level: red (>220kV), dark (110-220kV), light (distribution)",
        "Flood Risk Zones layer - visualize flood-prone areas with risk level filtering",
        "Flood zones shown as semi-transparent polygons with Very High/High/Medium/Low risk levels",
        "Sub-filters for both layers - toggle specific infrastructure types or risk levels",
        "Layers popover now shows count of active layers in badge"
      ]
    },
    {
      "version": "1.11.0",
      "date": "2026-02-01",
      "changes": [
        "New Layers popover in Atlas map - extensible panel for toggling data layers",
        "OSM Health Facilities layer renamed from 'Health' to indicate OpenStreetMap data source",
        "Facility type sub-filters - toggle visibility of hospitals, clinics, pharmacies, dentists, doctors individually",
        "Layers button shows active layer count badge when layers are enabled",
        "Rolodex filter panel redesigned with organization type categories and improved UX",
        "Fixed QuickAddActivityModal closing when clicking on dropdown popovers",
        "Enhanced popover and command UI components with better portal and interaction handling"
      ]
    },
    {
      "version": "1.10.0",
      "date": "2026-01-31",
      "changes": [
        "Humanitarian OpenStreetMap Team (HOT) tile layer added to Atlas and all map components",
        "Health Facilities data layer - toggle to show hospitals, clinics, pharmacies from OpenStreetMap",
        "Health facility popup with details: name, type, operator, beds, wheelchair access, phone, hours",
        "Loading indicator for health facilities showing spinner and facility count while fetching",
        "Map position preservation - switching tile layers no longer resets your view",
        "Unified map controls bar - search, 3D/2D toggle, reset, zoom stats all on same line",
        "Enhanced marker tooltip with org logo, name, acronym, status badge (green for implementation), and budget",
        "Text wrapping in marker tooltips for long activity titles, org names, and locations",
        "Calendar event modals updated with white background styling"
      ]
    },
    {
      "version": "1.9.0",
      "date": "2026-01-31",
      "changes": [
        "New StakeholdersGroup component for improved activity editor stakeholder management",
        "Enhanced ActivityOverviewGroup with additional fields and better layout",
        "Improved ActivityEditorNavigation with refined structure and navigation",
        "Updated activity creation page with improved layout and workflow",
        "Tree map table field improvements: Approach renamed to Intervention Type, Value to Sample Size, Effectiveness to Direction",
        "New Direction labels: Favorable & Significant, Favorable, Unfavorable, Unfavorable & Significant",
        "Real-time dynamic updates when editing intervention names in tree map table",
        "Text wrapping for parent tier labels (Level 1 & Level 2) in tree map visualization",
        "Improved D3 data join with stable IDs for smoother tree map updates",
        "New analytics visualization capabilities for enhanced data insights"
      ]
    },
    {
      "version": "1.8.0",
      "date": "2026-01-30",
      "changes": [
        "Pivot table cell drill-down - click any cell to see underlying transactions with activity links",
        "Pinned reports feature - star your favorite reports for quick access",
        "Filter breadcrumbs in pivot reports showing all applied filters at a glance",
        "Field preview tooltips showing sample values when hovering over available fields",
        "Dynamic fiscal year support with configurable fiscal year periods",
        "Enhanced pivot view with transaction month breakdown and improved code handling",
        "Organization profile social media buttons redesigned with colored brand logos and hover effects",
        "Library filters updated with modern checkbox styling and file type icons",
        "New activity editor navigation improvements",
        "Improved hierarchical sector select with better UX"
      ]
    },
    {
      "version": "1.7.0",
      "date": "2026-01-29",
      "changes": [
        "12 new pre-configured report templates including Regional Funding, Sector Trends, and Policy Marker Coverage",
        "Added new pivot fields: State/Region, Implementing Partners, Funding Organizations, Policy Markers, Humanitarian Scope",
        "Smart column sorting - Activity Status and Transaction Types now sort in logical order",
        "Atlas map now shows activity counts per sector in the filter panel",
        "Global loading bar indicator for Atlas map data loading",
        "Option to show only sectors with activities in sector filter",
        "Improved sector hierarchy filter with expandable categories",
        "Enhanced map markers layer with better clustering performance"
      ]
    },
    {
      "version": "1.6.1",
      "date": "2026-01-28",
      "changes": [
        "Fixed pivot table displaying codes instead of names for Aid Type, Finance Type, Flow Type, and Tied Status",
        "Added number format toggle - switch between abbreviated (K/M/B) and full numbers in pivot tables",
        "Map markers now reposition to top of viewport when clicked for better popup visibility",
        "Activity titles in map popups are now clickable links to the activity detail page",
        "Improved pivot table data refresh handling when filters change",
        "Fixed fiscal year filtering in pivot reports"
      ]
    },
    {
      "version": "1.6.0",
      "date": "2026-01-28",
      "changes": [
        "New Custom Report Builder with interactive pivot table for ad-hoc analysis",
        "Design Your Own tab allows creating custom reports with drag-and-drop fields",
        "Save and load pivot table configurations for reusable report templates",
        "Filter pivot data by organization, year, and transaction type",
        "Export pivot table results directly to CSV with one click",
        "Major map architecture cleanup - removed 20+ deprecated map components",
        "Streamlined MarkersLayer and ActivityMarkersLayer with improved clustering",
        "OrgActivitiesMap rewritten with better organization filtering",
        "Activity editor location handling improvements",
        "CSV export enhanced with proper handling of special characters and formulas"
      ]
    },
    {
      "version": "1.5.0",
      "date": "2026-01-27",
      "changes": [
        "Notification pagination with configurable items per page (saved to preferences)",
        "Publication status badge (Published/Unpublished) displayed in activity editor header",
        "Related Activities tab now read-only on activity detail view to prevent accidental edits",
        "Readiness Checklist tab integrated into activity editor workflow",
        "Edit Activity button restyled with primary color theme for better visibility",
        "Library tab renamed to Activity Library for clarity",
        "Map marker layer improvements for better performance",
        "UI refinements for feedback modal and activity voting components"
      ]
    },
    {
      "version": "1.4.0",
      "date": "2026-01-26",
      "changes": [
        "New Government Readiness Checklist feature for tracking preparatory milestones before project validation",
        "Dynamic checklist items based on financing type (Loan/Grant/TA/Mixed) and financing modality",
        "Six-stage readiness workflow: Project Identification, Appraisal, Negotiation, Approval, Effectiveness, Implementation",
        "Document upload support for checklist evidence with automatic status completion",
        "Stage sign-off functionality with signature tracking for formal approval workflow",
        "Integrated Endorsement Details section with validation status, validating authority, and date tracking",
        "Validating Authority dropdown now pulls actual government organizations from database with logos and acronyms",
        "Admin panel for managing readiness templates and checklist items",
        "Enhanced date picker component with portal rendering for reliable popup display",
        "Auto-save functionality for all readiness checklist fields",
        "Lucide icons added to validation status and financing type/modality dropdowns",
        "Government Endorsement tab merged into Readiness Checklist for streamlined workflow"
      ]
    },
    {
      "version": "1.3.0",
      "date": "2026-01-26",
      "changes": [
        "Atlas map filters now support multi-select for status and organization filtering",
        "Improved 2D/3D view toggle - shows contextual button based on current view mode",
        "Double-click on map markers to zoom in for detailed location view",
        "Activity Locations map upgraded to MapLibre GL for better performance",
        "Filter dropdowns now close automatically when another filter opens"
      ]
    },
    {
      "version": "1.2.0",
      "date": "2026-01-25",
      "changes": [
        "New Atlas map system with improved performance and visualization",
        "Added heatmap layer support for geographic data density visualization",
        "New embedded map component for organization analytics pages",
        "Redesigned global search bar with enhanced UX and better result handling",
        "Improved search result row display with cleaner layout",
        "Enhanced analytics charts with improved cumulative financial overview",
        "Updated finance type flow chart with better data visualization",
        "Financial totals bar chart improvements with expanded features",
        "Organization editor enhancements for better data management",
        "Myanmar regions map performance improvements",
        "Streamlined sidebar navigation by removing deprecated pages",
        "Various UI component refinements and hover card improvements"
      ]
    },
    {
      "version": "1.1.0",
      "date": "2026-01-25",
      "changes": [
        "Added version badge in sidebar header with hover popup showing recent changes",
        "New Build History page under Operations section showing all releases",
        "Version number now displays below the app title for better visibility",
        "Hover over version badge to see latest release notes at a glance",
        "Build History shows timeline of all production releases with change logs",
        "Click 'View full build history' in hover popup to see complete release history",
        "Releases data stored in centralized JSON file for easy updates",
        "Each release displays version number, date, and bullet list of changes"
      ]
    },
    {
      "version": "1.0.0",
      "date": "2026-01-24",
      "changes": [
        "Initial production release of æther Myanmar AIMS",
        "Activity management with full IATI compliance and XML import/export",
        "Transaction tracking with automatic USD conversion",
        "Planned disbursements management with period allocation",
        "Organization directory with contact management",
        "Interactive aid map (Atlas) with geographic visualization",
        "Analytics dashboard with financial summaries",
        "Document library for centralized file management",
        "Role-based access control with organization permissions",
        "IATI Registry search and activity import",
        "Comprehensive results framework tracking",
        "Multi-currency support with real-time exchange rates"
      ]
    }
  ]
}
